app/controllers/clients_controller.rb

SELECT `clients`.* FROM `clients`
---
  def index
  	@clients = Client.all

SELECT `clients`.* FROM `clients`
---
  def clients_off
  	@clients = Client.all

INSERT INTO `clients` (`name`, `alias`, `rif_ci`, `fiscal_address`, `comercial_address`, `phone`, `email`, `type_client`, `active`, `created_at`, `updated_at`) VALUES ('John Galindez', 'Empresa de consultas', 'J-2334', 2, 1, '04125674092', 'jgalindezj2@hotmail.com', 'Sponsor', 'Habilitado', '2015-06-11 01:12:11', '2015-06-11 01:12:11')
---
  def create
  	@client = Client.new(permit_params)

  	if @client.save

SELECT  `clients`.* FROM `clients` WHERE `clients`.`id` = 1 LIMIT 1
---
  	def edit
  		@client = Client.find(params[:id])

SELECT  `clients`.* FROM `clients` WHERE `clients`.`id` = 1 LIMIT 1
UPDATE `clients` SET `name` = 'John Requena', `updated_at` = '2015-06-11 04:15:34' WHERE `clients`.`id` = 1
---
  	def update
  		@client = Client.find(params[:id])

  		if @client.update(permit_params)

SELECT  `clients`.* FROM `clients` WHERE `clients`.`id` = 1 LIMIT 1
UPDATE `clients` SET `active` = 'Deshabilitado', `updated_at` = '2015-06-11 04:46:08' WHERE `clients`.`id` = 6
---
  def destroy
  	@client = Client.find(params[:id])
  	@client.active = 'Deshabilitado'
  	if @client.save